#ifndef CANDIDATE_WORDS_H
#define CANDIDATE_WORDS_H

#include <array>
#include <QString>

const std::array<QString, 100> CANDIDATE_WORDS = {
    "蘋果", "香蕉", "橙子", "葡萄", "西瓜", "鳳梨", "芒果", "櫻桃", "草莓", "藍莓",
    "檸檬", "奇異果", "柚子", "荔枝", "龍眼", "木瓜", "椰子", "番石榴", "柿子", "梨",
    "桃子", "李子", "杏子", "無花果", "石榴", "蓮霧", "火龍果", "百香果", "山竹", "榴槤",
    "楊桃", "釋迦", "枇杷", "蘆柑", "金桔", "柳丁", "文旦", "蜜柑", "橘子", "檳榔",
    "椪柑", "蜜桃", "水蜜桃", "水梨", "蘋婆", "蓮子", "銀杏", "栗子", "核桃", "杏仁",
    "開心果", "腰果", "松子", "花生", "瓜子", "葵花子", "榛子", "夏威夷果", "巴西堅果", "澳洲堅果",
    "南瓜子", "西瓜子", "蓮藕", "蘿蔔", "胡蘿蔔", "馬鈴薯", "番薯", "芋頭", "山藥", "菱角",
    "茭白筍", "玉米", "豌豆", "毛豆", "四季豆", "菜豆", "蠶豆", "豇豆", "綠豆", "紅豆",
    "黑豆", "黃豆", "花豆", "扁豆", "鷹嘴豆", "薏仁", "芝麻", "亞麻籽", "奇亞籽", "葫蘆巴",
    "藜麥", "小米", "高粱", "蕎麥", "燕麥", "大麥", "薰衣草", "迷迭香", "百里香", "羅勒"
};
 
#endif // CANDIDATE_WORDS_H